In [111]:
import pandas as pd

In [112]:
nikkei_25 = pd.read_csv("C:/Users/Admin/Documents/ironhack/ironhack-projects/Data_Thief_Project_Team_Wall-e/data/NIKKEI_225_JP.csv")

In [113]:
nikkei_25.head()

         date   value
0  1949-05-16  176.21
1  1949-05-17  174.80
2  1949-05-18  172.53
3  1949-05-19  171.34
4  1949-05-20  169.20

In [114]:
nikkei_25.columns = ["date", "value_NIKKEI_25_JP"]

In [115]:
nikkei_25.head()

         date  value_NIKKEI_25_JP
0  1949-05-16              176.21
1  1949-05-17              174.80
2  1949-05-18              172.53
3  1949-05-19              171.34
4  1949-05-20              169.20

In [116]:
nikkei_25["date"] = pd.to_datetime(nikkei_25["date"])

In [117]:
nikkei_25.dtypes

date                  datetime64[ns]
value_NIKKEI_25_JP           float64
dtype: object

In [118]:
nikkei_25 = (nikkei_25[nikkei_25["date"] >= "2019-01-01"]
             .reset_index()
             .drop(columns="index"))

In [119]:
#nikkei_25.drop(columns="index")

In [120]:
nikkei_25.head()

        date  value_NIKKEI_25_JP
0 2019-01-04            19561.96
1 2019-01-07            20038.97
2 2019-01-08            20204.04
3 2019-01-09            20427.06
4 2019-01-10            20163.80

In [121]:
nikkei_25.dtypes

date                  datetime64[ns]
value_NIKKEI_25_JP           float64
dtype: object

In [122]:
nikkei_25 = nikkei_25.sort_values("date", ascending=False)

In [123]:
nikkei_25 = nikkei_25.reset_index().drop(columns="index")

In [124]:
nikkei_25.head()

        date  value_NIKKEI_25_JP
0 2020-04-07            18950.18
1 2020-04-06            18576.30
2 2020-04-03            17820.19
3 2020-04-02            17818.72
4 2020-04-01            18065.41

In [125]:
nikkei_25.to_csv("C:/Users/Admin/Documents/ironhack/ironhack-projects/Data_Thief_Project_Team_Wall-e/data/NIKKEI_225_JP_clean.csv", index=False)